FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
#include "joint_manager.h"
#include "FreeRTOS.h"
#include "common.h"
#include "drv8825.h"
#include "event.h"
#include "manager.h"
#include "motor_driver.h"
#include "notify.h"
#include "pid_regulator.h"
#include "step_motor.h"
#include "stm32f4xx_hal.h"
#include "task.h"
#include <assert.h>
#include <stdint.h>
#include <string.h>

static char const* const TAG = "joint_manager";

static inline bool frequency_to_prescaler_and_period(uint32_t frequency_hz,
                                                     uint32_t clock_hz,
                                                     uint32_t max_prescaler,
                                                     uint32_t max_period,
                                                     uint32_t* prescaler,
                                                     uint32_t* period)
{
    if (frequency_hz == 0U || !prescaler || !period) {
        return false;
    }

    uint32_t temp_prescaler = 0U;
    uint32_t temp_period = clock_hz / frequency_hz;

    while (temp_period > max_period && temp_prescaler < max_prescaler) {
        temp_prescaler++;
        temp_period = clock_hz / ((temp_prescaler + 1U) * frequency_hz);
    }
    if (temp_period > max_period) {
        temp_period = max_period;
        temp_prescaler = (clock_hz / (temp_period * frequency_hz)) - 1U;
    }
    if (temp_prescaler > max_prescaler) {
        temp_prescaler = max_prescaler;
    }

    *prescaler = temp_prescaler;
    *period = temp_period;

    return true;
}

static inline drv8825_err_t drv8825_gpio_initialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_gpio_deinitialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_gpio_write_pin(void* user,
                                                   uint32_t pin,
                                                   bool state)
{
    joint_config_t* config = (joint_config_t*)user;

    HAL_GPIO_WritePin(config->drv8825_dir_gpio,
                      config->drv8825_dir_pin,
                      (GPIO_PinState)state);

    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_initialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_deinitialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_start(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    HAL_TIM_PWM_Start_IT(config->drv8825_pwm_timer,
                         config->drv8825_pwm_channel);

    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_stop(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    HAL_TIM_PWM_Stop_IT(config->drv8825_pwm_timer, config->drv8825_pwm_channel);

    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_set_frequency(void* user,
                                                      uint32_t frequency)
{
    joint_config_t* config = (joint_config_t*)user;

    uint32_t clock_hz = HAL_RCC_GetPCLK1Freq();
    if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1) {
        clock_hz *= 2;
    }

    uint32_t prescaler;
    uint32_t period;
    bool result = frequency_to_prescaler_and_period(frequency,
                                                    clock_hz,
                                                    0xFFFFU,
                                                    0xFFFFU,
                                                    &prescaler,
                                                    &period);

    if (result && period < 0xFFFFU && prescaler < 0xFFFFU) {
        uint32_t tick_hz = clock_hz / (prescaler + 1);
        uint32_t compare = (tick_hz / 1000000) * 5; // 5us pulse
        if (compare == 0) {
            compare = 1;
        }
        if (compare > period) {
            compare = period;
        }

        __HAL_TIM_DISABLE(config->drv8825_pwm_timer);
        __HAL_TIM_SET_COUNTER(config->drv8825_pwm_timer, 0U);
        __HAL_TIM_SET_PRESCALER(config->drv8825_pwm_timer, prescaler);
        __HAL_TIM_SET_AUTORELOAD(config->drv8825_pwm_timer, period);
        __HAL_TIM_SET_COMPARE(config->drv8825_pwm_timer,
                              config->drv8825_pwm_channel,
                              compare);
        __HAL_TIM_ENABLE(config->drv8825_pwm_timer);

        ATLAS_LOG(TAG,
                  "frequency: %u, period: %u, prescaler: %u, compare: %u",
                  frequency,
                  period,
                  prescaler,
                  compare);
    }

    return DRV8825_ERR_OK;
}

static inline as5600_err_t as5600_gpio_initialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_gpio_deinitialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_gpio_write_pin(void* user,
                                                 uint32_t pin,
                                                 bool state)
{
    joint_config_t* config = (joint_config_t*)user;

    HAL_GPIO_WritePin(config->as5600_dir_gpio,
                      config->as5600_dir_pin,
                      (GPIO_PinState)state);

    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_bus_initialize(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_IsDeviceReady(config->as5600_i2c_bus,
                                 config->as5600_i2c_address,
                                 3U,
                                 100U) == HAL_OK
               ? AS5600_ERR_OK
               : AS5600_ERR_FAIL;
}

static inline as5600_err_t as5600_bus_deinitialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_bus_write_data(void* user,
                                                 uint8_t address,
                                                 uint8_t const* data,
                                                 size_t data_size)
{
    joint_config_t* config = (joint_config_t*)user;

    // SemaphoreHandle_t joint_mutex =
    // semaphore_manager_get(SEMAPHORE_TYPE_JOINT);

    // if (xSemaphoreTake(joint_mutex, pdMS_TO_TICKS(1))) {
    HAL_I2C_Mem_Write(config->as5600_i2c_bus,
                      config->as5600_i2c_address << 1U,
                      address,
                      I2C_MEMADD_SIZE_8BIT,
                      data,
                      data_size,
                      100);
    //     xSemaphoreGive(joint_mutex);
    // }

    return AS5600_ERR_OK;
}

