FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
static inline motor_driver_err_t motor_driver_encoder_get_position(
    void* user,
    float32_t* position)
{
    ATLAS_ASSERT(user && position);

    joint_manager_t* manager = (joint_manager_t*)user;

    as5600_get_angle_data_scaled_bus(&manager->as5600, position);

    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_get_control(
    void* user,
    float32_t error,
    float32_t* control,
    float32_t delta_time)
{
    ATLAS_ASSERT(user && control);

    joint_manager_t* manager = (joint_manager_t*)user;

    pid_regulator_get_sat_control(&manager->regulator,
                                  error,
                                  delta_time,
                                  control);

    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_get_current(
    void* user,
    float32_t* current)
{
    ATLAS_ASSERT(user && current);

    joint_manager_t* manager = (joint_manager_t*)user;

    *current = 1.0F;

    return MOTOR_DRIVER_ERR_OK;
}

static inline bool joint_manager_has_joint_event(void)
{
    return uxQueueMessagesWaiting(queue_manager_get(QUEUE_TYPE_JOINT)) ==
           pdPASS;
}

static inline bool joint_manager_send_system_notify(system_notify_t notify)
{
    return xTaskNotify(task_manager_get(TASK_TYPE_SYSTEM),
                       (uint32_t)notify,
                       eSetBits) == pdPASS;
}

static inline bool joint_manager_send_system_event(system_event_t const* event)
{
    ATLAS_ASSERT(event);

    return xQueueSend(queue_manager_get(QUEUE_TYPE_SYSTEM),
                      event,
                      pdMS_TO_TICKS(1)) == pdPASS;
}

static inline bool joint_manager_receive_joint_event(joint_event_t* event)
{
    ATLAS_ASSERT(event);

    return xQueueReceive(queue_manager_get(QUEUE_TYPE_JOINT),
                         event,
                         pdMS_TO_TICKS(1)) == pdPASS;
}

static inline bool joint_manager_receive_joint_notify(joint_notify_t* notify)
{
    ATLAS_ASSERT(notify);

    return xTaskNotifyWait(0,
                           JOINT_NOTIFY_ALL,
                           (uint32_t*)notify,
                           pdMS_TO_TICKS(1)) == pdPASS;
}

static atlas_err_t joint_manager_notify_delta_elapsed_handler(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    if (manager->reference.delta_time == 0.0F || manager->has_fault) {
        return ATLAS_ERR_FAIL;
    }

    motor_driver_err_t err =
        motor_driver_set_position(&manager->driver,
                                  manager->reference.position,
                                  manager->reference.delta_time);

    if (err != MOTOR_DRIVER_ERR_OK) {
        if (!joint_manager_send_system_notify(SYSTEM_NOTIFY_JOINT_FAULT)) {
            return ATLAS_ERR_FAIL;
        }

        motor_driver_set_speed(&manager->driver,
                               0.0F,
                               manager->reference.delta_time);
        manager->has_fault = true;
    } else {
        motor_driver_state_t state;
        motor_driver_get_state(&manager->driver, &state);

        ATLAS_LOG(
            TAG,
            "measure position: %f, reference position: %f, error position: "
            "%f, control speed: %f, fault current: %f",
            state.measure_position,
            manager->reference.position,
            state.measure_position - manager->reference.position,
            state.control_speed,
            state.fault_current);

        manager->measure.position = state.measure_position;
        manager->measure.current = state.fault_current;

        system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT};
        event.type = SYSTEM_EVENT_TYPE_JOINT_MEASURE;
        event.payload.joint_measure = manager->measure;

        if (!joint_manager_send_system_event(&event)) {
            return ATLAS_ERR_FAIL;
        }

        atlas_joint_measure_print(&manager->measure);

        if (manager->has_fault) {
            manager->has_fault = false;
        }
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_notify_pwm_pulse_handler(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    step_motor_update_step_count(&manager->motor);

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_notify_handler(joint_manager_t* manager,
                                                joint_notify_t notify)
{
    ATLAS_ASSERT(manager);

    if ((notify & JOINT_NOTIFY_DELTA_ELAPSED) == JOINT_NOTIFY_DELTA_ELAPSED) {
        ATLAS_RET_ON_ERR(joint_manager_notify_delta_elapsed_handler(manager));
    }
    if ((notify & JOINT_NOTIFY_PWM_PULSE) == JOINT_NOTIFY_PWM_PULSE) {
        ATLAS_RET_ON_ERR(joint_manager_notify_pwm_pulse_handler(manager));
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_start_handler(
    joint_manager_t* manager,
    joint_event_payload_start_t const* payload)
{
    ATLAS_ASSERT(manager && payload);
    ATLAS_LOG_FUNC(TAG);

    if (manager->is_running) {
        return ATLAS_ERR_ALREADY_RUNNING;
    }

    if (manager->has_fault) {
        return ATLAS_ERR_IMPROPER_STATE;
    }

    manager->is_running = true;

#ifdef DELTA_TEST
    manager->reference.delta_time = 0.01F;
    manager->reference.position = 100.0F;
    xTimerStart(timer_manager_get(TIMER_TYPE_DELTA_TEST), pdMS_TO_TICKS(1));
#endif

    return ATLAS_ERR_OK;
}

